ChalesYu/rtl8822bs-aml/RT-Thread/RT-Thread/board/usb/stm32_usb_otg_host.c
/****************************************Copyright (c)****************************************************
**                             成 都 世 纪 华 宁 科 技 有 限 公 司
**                                http://www.huaning-iot.com
**                                http://hichard.taobao.com
**
**
**--------------File Info---------------------------------------------------------------------------------
** File Name:           stm32_usb_otg_host.c
** Last modified Date:  2020-05-20
** Last Version:        v1.00
** Description:         USB主机操作功能函数实现
**--------------------------------------------------------------------------------------------------------
** Created By:          Renhaibo
** Created date:        2020-05-20
** Version:             v1.00
** Descriptions:        
**--------------------------------------------------------------------------------------------------------
** Modified by:         
** Modified date:       
** Version:             
** Description:         
*********************************************************************************************************/
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <rtthread.h>
#include <rtdevice.h>

#include "hal/cortexm/hal_cortexm_api.h"

#include "hal/arch/inc/arch_io_memmap.h"
#include "hal/arch/inc/arch_io_reg.h"
#include "hal/arch/inc/arch_io_rcc.h"
#include "hal/arch/inc/arch_io_ints.h"
#include "hal/arch/inc/arch_io_dma.h"
#include "hal/arch/inc/arch_io_gpio.h"

#include "stm32_usb_otg.h"
#include "stm32_usb_otg_host.h"

/*********************************************************************************************************
** 函数声明
*********************************************************************************************************/
static void usb_otg_data_send(stm32_usb_host_t* host, uint8_t hc_num);

/*********************************************************************************************************
** Function name:       usb_host_port_changed_callback
** Descriptions:        主机Port状态改变回调函数
** input parameters:    host:       USB主机结构
**                      new_state： 改变后的状态
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
RT_WEAK void usb_host_port_changed_callback(stm32_usb_host_t* host, host_port_state_t new_state)
{
}

/*********************************************************************************************************
** Function name:       usb_host_sof_callback
** Descriptions:        主机sof回调
** input parameters:    hcd:    USB主机结构
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
RT_WEAK void usb_host_sof_callback(stm32_usb_host_t* host)
{
}

/*********************************************************************************************************
** Function name:       usb_host_notify_urb_finish_callback
** Descriptions:        主机一次urb完成回调
** input parameters:    host:    USB主机结构
**                      chnum:  主机通道编号
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
static void usb_host_notify_urb_finish_callback(stm32_usb_host_t *host, uint8_t chnum)
{
   stm32_usb_host_channel_t* hc = &host->hc[chnum];
    if(hc->xfer_done){
        rt_completion_done(&hc->urb_completion);
    }
}

/*********************************************************************************************************
** Function name:       usb_otg_phy_clock_set
** Descriptions:        设置USB OTG的Phy clock
** input parameters:    u32Base:    USB在CPU总线的基地址
**                      u8Freq：    时钟频率，可以选下列值中的一个
**                             HCFG_48_MHZ      // 48 MHz Clock 
**                             HCFG_6_MHZ       // 6 MHz Clock       
** output parameters:   NONE
** Returned value:      -1: 初始化失败； 0：初始化成功
*********************************************************************************************************/
static void usb_otg_phy_clock_set(uint32_t u32Base, uint8_t u8Freq)
{
  HWREG32(u32Base + USB_OTG_HCFG) &= ~(3U << 0);
  HWREG32(u32Base + USB_OTG_HCFG) |= ((3U << 0) & (uint32_t)(u8Freq));
  
  if (u8Freq ==  HCFG_48_MHZ)
  {
    HWREG32(u32Base + USB_OTG_HFIR) = 48000U;
  }
  else if (u8Freq ==  HCFG_6_MHZ)
  {
     HWREG32(u32Base + USB_OTG_HFIR) = 6000U;
  }
}

/*********************************************************************************************************
** Function name:       usb_otg_host_stop
** Descriptions:        终止usb host
** input parameters:    host:        USB主机特征结构
**                      u8Freq：    时钟频率，可以选下列值中的一个
**                             HCFG_48_MHZ      // 48 MHz Clock 
**                             HCFG_6_MHZ       // 6 MHz Clock       
** output parameters:   NONE
** Returned value:      -1: 初始化失败； 0：初始化成功
*********************************************************************************************************/
static void usb_otg_host_stop(stm32_usb_host_t* host)
{
  uint32_t u32Base = host->base;
  uint32_t value;
  uint32_t i;

  /* Disable global int */
  HWREG32(u32Base + USB_OTG_GAHBCFG) &= ~USB_OTG_GAHBCFG_GINT;
  /* Flush FIFO */
  usb_flush_tx(u32Base, 0x10U);
  usb_flush_rx(u32Base);
  
  /* Flush out any leftover queued requests. */
  for (i = 0U; i <= 15U; i++)
  {
    value = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * i);
    value |=  USB_OTG_HCCHAR_CHDIS;
    value &= ~USB_OTG_HCCHAR_CHENA;
    value &= ~USB_OTG_HCCHAR_EPDIR;
    HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * i) = value;
  }

  /* Halt all channels to put them into a known state. */
  for (i = 0U; i <= 15U; i++)
  {
    uint32_t count = 0U;
    value = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * i);
    value |= USB_OTG_HCCHAR_CHDIS;
    value |= USB_OTG_HCCHAR_CHENA;
    value &= ~USB_OTG_HCCHAR_EPDIR;
    HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * i) = value;
    do{
      if (++count > 2000U) break;
    }while ((HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * i) & USB_OTG_HCCHAR_CHENA) == USB_OTG_HCCHAR_CHENA);
  }

  /* Clear any pending Host interrupts */
  HWREG32(u32Base + USB_OTG_HAINT) = 0xFFFFFFFFU;
  HWREG32(u32Base + USB_OTG_GINTSTS) = 0xFFFFFFFFU;
  /* Enable global int */
  HWREG32(u32Base + USB_OTG_GAHBCFG) |= USB_OTG_GAHBCFG_GINT;
}

