ChalesYu/rtl8822bs-aml/RT-Thread/RT-Thread/board/usb/stm32_usb_otg_host.c
/*********************************************************************************************************
** Function name:       usb_otg_host_disconnect
** Descriptions:        usb host 断开连接处理函数
** input parameters:    host:       USB主机特征结构     
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
static void usb_otg_host_disconnect(stm32_usb_host_t* host)
{
  uint32_t u32Base = host->base;
  
  usb_otg_host_stop(host);
  host->state = USB_HOST_PORT_DISCONNECTED;
  
  memset(host->hc, 0, sizeof(host->hc));
  
  HWREG32(u32Base + USB_OTG_GAHBCFG) |= USB_OTG_GAHBCFG_GINT;
  usb_otg_vbus_drive(u32Base, 1);
  
  usb_host_port_changed_callback(host, USB_HOST_PORT_DISCONNECTED);
}

/*********************************************************************************************************
** Function name:       usb_host_port_handler
** Descriptions:        usb host port中断处理
** input parameters:    host:       USB主机特征结构     
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
static void usb_host_port_handler(stm32_usb_host_t* host)
{
  uint32_t u32Base = host->base;
  uint32_t hprt0 = HWREG32(u32Base + USB_OTG_HPRT);
  uint32_t hprt0_dup = HWREG32(u32Base + USB_OTG_HPRT);
  
  hprt0_dup &= ~((1UL << 2) | (1UL << 1) | (1UL << 3) | (1UL << 5));
  
  if( hprt0 & (1UL << 1) ) {
    // Port connect detect
    if( hprt0 & (1UL << 0) ){
      // A device is attached
      HWREG32(u32Base + USB_OTG_GINTMSK) &= ~(USB_OTG_GINTSTS_DISCINT);
      // Post connect message
      host->state = USB_HOST_PORT_CONNECTED;
      usb_host_port_changed_callback(host, USB_HOST_PORT_CONNECTED);
    }
    // write 1 to clear the PCDET int flag
    hprt0_dup  |= (1UL << 1);
  }
  
  if( hprt0 & (1UL << 3) ) {
    // Port enable changed
    if( hprt0 & (1UL << 2) ){
      if(host->phy_interface  == USB_OTG_EMBEDDED_FS_PHY) {
        if ((hprt0 & (3UL << 17)) == (USB_OTG_SPEED_LOW << 17)){
          // Low speed
          usb_otg_phy_clock_set(u32Base, HCFG_6_MHZ);
        }else{
          // Full speed
          usb_otg_phy_clock_set(u32Base, HCFG_48_MHZ);
        }
      }else{
        if(host->phy_speed == USB_OTG_SPEED_FULL) {
          // FS phy
          HWREG32(u32Base + USB_OTG_HFIR) = 6000U;
        } else {
          HWREG32(u32Base + USB_OTG_HCFG) &= ~(3U << 0);
          HWREG32(u32Base + USB_OTG_HFIR) = 60000U;
        }
      }
      host->state = USB_HOST_PORT_ENABLED;
      /* Flush FIFO */
      usb_flush_tx(u32Base, 0x10U);
      usb_flush_rx(u32Base);
      usb_host_port_changed_callback(host, USB_HOST_PORT_ENABLED);
      // Port enabled
    }else{
      // Port disabled
      HWREG32(u32Base + USB_OTG_HPRT) &= ~((1UL << 2) | (1UL << 1) | (1UL << 3) | (1UL << 5) );
      HWREG32(u32Base + USB_OTG_GINTMSK) |= USB_OTG_GINTSTS_DISCINT;
      host->state = USB_HOST_PORT_DISABLED;
      usb_host_port_changed_callback(host, USB_HOST_PORT_DISABLED);
    }
    hprt0_dup |= (1UL << 3);
  }
  
  if(hprt0 & (1UL << 5))
  {
    hprt0_dup |= (1UL << 5);
  }
  HWREG32(u32Base + USB_OTG_HPRT) = hprt0_dup;
}

/*********************************************************************************************************
** Function name:       usb_port_reset
** Descriptions:        usb host复位
** input parameters:    host:   USB主机特征结构     
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
void usb_port_reset(stm32_usb_host_t* host)
{
  uint32_t u32Base = host->base;
  volatile uint32_t hprt0;
  
  hprt0 = HWREG32(u32Base + USB_OTG_HPRT);
  hprt0 &= ~((1UL << 2) | (1UL << 1) | (1UL << 3) | (1UL << 5));
  HWREG32(u32Base + USB_OTG_HPRT) = ((1UL << 8) | hprt0); 
  rt_thread_mdelay(100);
  HWREG32(u32Base + USB_OTG_HPRT) = ((~(1UL << 8)) & hprt0); 
  rt_thread_mdelay(10);
}

/*********************************************************************************************************
** Function name:       usb_otg_host_rx_handler
** Descriptions:        usb host接收数据中断服务处理函数
** input parameters:    host:   USB主机特征结构     
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
static void usb_otg_host_rx_handler(stm32_usb_host_t* host)
{
  uint32_t u32Base = host->base;
  uint32_t sts = HWREG32(u32Base + USB_OTG_GRXSTSP);
  uint8_t ch_num = sts & 0x0FU;
  uint32_t len = (sts & (0x7FFU << 4)) >> 4;
  
  if(((sts & (0x0FU << 17)) >> 17) ==  2U){
    stm32_usb_host_channel_t* hc = &host->hc[ch_num];
    if(hc->ch_buf && hc->count < hc->size){
      usb_otg_data_read(u32Base, hc->ch_buf + hc->count, len);
      hc->count += len;
    }else{
      usb_otg_data_read(u32Base, 0, len);
    }
    if(HWREG32(u32Base + USB_OTG_HCTSIZ0 + 0x20UL * ch_num) & (0x3FFU << 19)){
      uint32_t tmpreg = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num);
      tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
      tmpreg |= USB_OTG_HCCHAR_CHENA;
      HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) = tmpreg;
      //hc->toggle_in ^= 1;
      hc->toggle = ((HWREG32(u32Base + USB_OTG_HCTSIZ0 + 0x20UL * ch_num) >> 29) & 0x03UL);
    }
  }
}

/*********************************************************************************************************
** Function name:       usb_otg_channel_halt
** Descriptions:        usb host停止一个cahhnel
** input parameters:    u32Base:    USB在CPU总线的基地址 
**                      ch_num:     待停止的channel号
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
static void usb_otg_channel_halt(uint32_t u32Base, uint8_t ch_num)
{
  uint32_t  hc_char;
  uint32_t  ep_type;
  uint32_t tx_q_space = 0;
  
  hc_char = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num);
  hc_char |= (USB_OTG_HCCHAR_CHDIS | USB_OTG_HCCHAR_CHENA);
  ep_type = (hc_char & USB_OTG_HCCHAR_EPTYP) >> 18u;
  /* Check for space in the request queue to issue the halt. */
  if ((ep_type == EP_TYPE_CTRL) || (ep_type == EP_TYPE_BULK)) {
    tx_q_space = HWREG32(u32Base + USB_OTG_GNPTXSTS) & (0xFFU << 16);
  }else{
    tx_q_space = HWREG32(u32Base + USB_OTG_HPTXSTS) & (0xFFU << 16);
  }
  
