ChalesYu/rtl8822bs-aml/RT-Thread/RT-Thread/board/usb/stm32_usb_otg_host.c
  if(tx_q_space == 0) {
    hc_char &= ~USB_OTG_HCCHAR_CHENA;
  }
  
  HWREG32(u32Base + USB_OTG_HCINTMSK0 + 0x20UL * ch_num) |= USB_OTG_HCINTMSK_CHHM;
  HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) = hc_char;
  
  
//  uint32_t HcEpType = (HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) & USB_OTG_HCCHAR_EPTYP) >> 18;
//  uint32_t tx_q_space = 0;
//  uint32_t dir = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) & USB_OTG_HCCHAR_EPDIR;
//  
//  /* Check for space in the request queue to issue the halt. */
//  if ((HcEpType == EP_TYPE_CTRL) || (HcEpType == EP_TYPE_BULK)) {
//    HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) |= USB_OTG_HCCHAR_CHDIS;
//    tx_q_space = HWREG32(u32Base + USB_OTG_GNPTXSTS) & (0xFFU << 16);
//  }else{
//    HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) |= USB_OTG_HCCHAR_CHDIS;
//    tx_q_space = HWREG32(u32Base + USB_OTG_HPTXSTS) & (0xFFU << 16);
//  }
//  if(tx_q_space == 0){
//    uint32_t count = 0U;
//    HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) &= ~USB_OTG_HCCHAR_CHENA;
//    HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) |= USB_OTG_HCCHAR_CHENA;
//    HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) &= ~USB_OTG_HCCHAR_EPDIR;
//    do {
//      if (++count > 1000U) {
//        break;
//      }
//    } while ((HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) & USB_OTG_HCCHAR_CHENA) == USB_OTG_HCCHAR_CHENA);
//  }else{
//    HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) |= USB_OTG_HCCHAR_CHENA;
//  }
//  
//  HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) |= dir;
}

/*********************************************************************************************************
** Function name:       usb_otg_in_channel_handler
** Descriptions:        usb host in channel中断处理函数
** input parameters:    host:   USB主机特征结构   
**                      ch_num: 指定处理channel号
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
#define  USB_OTG_CLEAR_HC_INT(base, chnum,interrupt)    (HWREG32(base + USB_OTG_HCINT0 + 0x20UL * chnum) = (interrupt))
#define  USB_OTG_UNMASK_HALT_HC_INT(base,chnum)         (HWREG32(base + USB_OTG_HCINTMSK0 + 0x20UL * chnum) |= (USB_OTG_HCINT_CHH))
#define  USB_OTG_MASK_HALT_HC_INT(base,chnum)           (HWREG32(base + USB_OTG_HCINTMSK0 + 0x20UL * chnum) &= ~(USB_OTG_HCINT_CHH))

static void usb_otg_in_channel_handler(stm32_usb_host_t* host, uint8_t ch_num)
{
  uint32_t u32Base = host->base;
  uint32_t u32Channel = u32Base + 0x20UL * ch_num;
  stm32_usb_host_channel_t* hc = &host->hc[ch_num];
  uint32_t tmpreg;
  
  if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_AHBERR) == USB_OTG_HCINT_AHBERR)
  {
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_AHBERR);
    USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
  }
  else if((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_BBERR) == USB_OTG_HCINT_BBERR)
  {
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_BBERR);
    USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
  }
  else if((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_ACK) == USB_OTG_HCINT_ACK)
  {
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_ACK);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_STALL) == USB_OTG_HCINT_STALL)
  {
    USB_OTG_UNMASK_HALT_HC_INT(u32Base,ch_num);
    hc->state = USB_CS_STALL;
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_NAK);
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_STALL);
    usb_otg_channel_halt(u32Base, ch_num);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_DTERR) == USB_OTG_HCINT_DTERR)
  {
    USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
    usb_otg_channel_halt(u32Base, ch_num);
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_NAK);
    hc->state = USB_CS_DT_ERROR;
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_DTERR);
  }
  else
  {
    /* ... */
  }

  if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_FRMOR) == USB_OTG_HCINT_FRMOR)
  {
    USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
    usb_otg_channel_halt(u32Base, ch_num);
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_FRMOR);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_XFRC) == USB_OTG_HCINT_XFRC)
  {
    uint32_t HcEpType = (HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) & USB_OTG_HCCHAR_EPTYP) >> 18;
    (void)HcEpType;
    if (HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN){
      uint32_t mps = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) & (0x7FFUL << 0);
      uint32_t pkt_cnt = (hc->size + mps - 1) / mps;
      uint32_t remain =  HWREG32(u32Base + USB_OTG_HCTSIZ0 + 0x20UL * ch_num) & (0x7FFFFUL << 0);
      hc->count = mps*pkt_cnt - remain;
    }

    hc->state = USB_CS_TRANSFER_COMPLETE;
    hc->error_count = 0U;
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_XFRC);
    
    USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
    usb_otg_channel_halt(u32Base, ch_num);
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_NAK);    
    //hc->toggle_in ^= 1U;
    hc->toggle = ((HWREG32(u32Channel + USB_OTG_HCTSIZ0) >> 29) & 0x03UL);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_CHH) == USB_OTG_HCINT_CHH)
  {
    USB_OTG_MASK_HALT_HC_INT(u32Base, ch_num);
    if(hc->is_cancel){
      hc->xfer_done = 1;
      hc->is_cancel = 0;
      hc->state = USB_CS_XFER_CANCEL;
    }else if(hc->state == USB_CS_TRANSFER_COMPLETE)
    {
      hc->xfer_done = 1;
    }
    else if (hc->state == USB_CS_STALL)
    {
      hc->xfer_done = 1;
    }
    else if(hc->state == USB_CS_TRANSACTION_ERROR)
    {
      hc->error_count++;
      if(hc->error_count > MAX_ERROR_RETRY_TIME){
        hc->xfer_done = 1;
      }else{
        /* re-activate the channel  */
        tmpreg = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num);
        tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
        tmpreg |= USB_OTG_HCCHAR_CHENA;
        HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) = tmpreg;
      }
    }
    else if (hc->state == USB_CS_DT_ERROR)
    {
        hc->xfer_done = 1;
    }
    else if (hc->state == USB_CS_NAK)
    {
      /* re-activate the channel  */
      hc->nak_count++;
      hc->error_count = 0;
//      if(hc->nak_count > MAX_NAK_RETRY_TIME){
//        hc->xfer_done = 1;
//      }else{
        if (HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN){
          tmpreg = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num);
          tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
          tmpreg |= USB_OTG_HCCHAR_CHENA;
          HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) = tmpreg;
        }else{
          //usb_otg_host_submit(host, ch_num);
          tmpreg = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num);
          tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
          tmpreg |= USB_OTG_HCCHAR_CHENA;
          HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) = tmpreg;
        }
//      }
    }
    else
    {
      /* ... */
      if (HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN){
        if(host->state == USB_HOST_PORT_ENABLED) {
          usb_otg_host_submit(host, ch_num);
          //        USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
          //        tmpreg = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num);
          //        tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
          //        tmpreg |= USB_OTG_HCCHAR_CHENA;
          //        HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) = tmpreg;
        }
      }
    }
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_CHH);
    usb_host_notify_urb_finish_callback(host, ch_num);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_TXERR) == USB_OTG_HCINT_TXERR)
  {
    USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
    hc->state = USB_CS_TRANSACTION_ERROR;
    usb_otg_channel_halt(u32Base, ch_num);
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_TXERR);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_NAK) == USB_OTG_HCINT_NAK)
  {
    uint32_t HcEpType = (HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) & USB_OTG_HCCHAR_EPTYP) >> 18;
    if(HcEpType == EP_TYPE_INTR)
    {
      hc->xfer_done = 1;
      hc->state = USB_CS_INT_NAK;
      USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
      usb_otg_channel_halt(u32Base, ch_num);
    }
    else if ((HcEpType == EP_TYPE_CTRL)|| (HcEpType == EP_TYPE_BULK))
    {
       hc->error_count = 0U;
       if ((HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN) == 0)
       {
         hc->state = USB_CS_NAK;
         USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
         usb_otg_channel_halt(u32Base, ch_num);
       }
    }
    else
    {
      /* ... */
    }
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_NAK);
  }
  else
  {
    /* ... */
  }
}

