ChalesYu/rtl8822bs-aml/RT-Thread/RT-Thread/board/usb/stm32_usb_otg_host.c
/*********************************************************************************************************
** Function name:       usb_otg_out_channel_handler
** Descriptions:        usb host out channel中断处理函数
** input parameters:    host:    USB主机特征结构   
**                      ch_num:  指定处理channel号
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
static void usb_otg_out_channel_handler(stm32_usb_host_t* host, uint8_t ch_num)
{
  uint32_t u32Base = host->base;
  uint32_t u32Channel = u32Base + 0x20UL * ch_num;
  stm32_usb_host_channel_t* hc = &host->hc[ch_num];
  uint32_t tmpreg;

  if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_AHBERR) == USB_OTG_HCINT_AHBERR)
  {
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_AHBERR);
    USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_ACK) == USB_OTG_HCINT_ACK)
  {
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_ACK);
    if( hc->do_ping == 1U)
    {
      hc->state = USB_CS_ACK;
      hc->do_ping = 0U;
      USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
      usb_otg_channel_halt(u32Base, ch_num);
    }
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_NYET) == USB_OTG_HCINT_NYET)
  {
    hc->state = USB_CS_NYET;
    USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
    usb_otg_channel_halt(u32Base, ch_num);
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_NYET);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_FRMOR) == USB_OTG_HCINT_FRMOR)
  {
    USB_OTG_UNMASK_HALT_HC_INT(u32Base,ch_num);
    usb_otg_channel_halt(u32Base, ch_num);
    USB_OTG_CLEAR_HC_INT(u32Base,ch_num, USB_OTG_HCINT_FRMOR);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_XFRC) == USB_OTG_HCINT_XFRC)
  {
    USB_OTG_UNMASK_HALT_HC_INT(u32Base,ch_num);
    usb_otg_channel_halt(u32Base, ch_num);
    USB_OTG_CLEAR_HC_INT(u32Base,ch_num, USB_OTG_HCINT_XFRC);
    hc->state = USB_CS_TRANSFER_COMPLETE;
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_STALL) == USB_OTG_HCINT_STALL)
  {
    hc->state = USB_CS_STALL;
    USB_OTG_CLEAR_HC_INT(u32Base,ch_num, USB_OTG_HCINT_STALL);
    USB_OTG_UNMASK_HALT_HC_INT(u32Base,ch_num);
    usb_otg_channel_halt(u32Base, ch_num);
    
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_NAK) == USB_OTG_HCINT_NAK)
  {
    if (!(HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN)){
      hc->error_count = 0U;
      hc->state = USB_CS_NAK;
      if (hc->do_ping == 0){
        if (hc->speed == USB_OTG_SPEED_HIGH){
//          if (!(HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN)){
            hc->do_ping = 1;
//          }
        }
      }
      USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
      usb_otg_channel_halt(u32Base, ch_num);
    }
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_NAK);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_TXERR) == USB_OTG_HCINT_TXERR)
  {
    USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
    usb_otg_channel_halt(u32Base, ch_num);
    hc->state = USB_CS_TRANSACTION_ERROR;
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_TXERR);
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_DTERR) == USB_OTG_HCINT_DTERR)
  {
    USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
    usb_otg_channel_halt(u32Base, ch_num);
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_NAK);
    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_DTERR);
    hc->state = USB_CS_DT_ERROR;
  }
  else if ((HWREG32(u32Channel + USB_OTG_HCINT0) & USB_OTG_HCINT_CHH) == USB_OTG_HCINT_CHH)
  {
    USB_OTG_MASK_HALT_HC_INT(u32Base, ch_num);
    if(hc->is_cancel){
      hc->xfer_done = 1;
      hc->state = USB_CS_XFER_CANCEL;
    }else if (hc->state == USB_CS_XFER_ONGOING){
      hc->state = USB_CS_INIT;
      usb_otg_host_submit(host, ch_num);
    }else if (hc->state == USB_CS_TRANSFER_COMPLETE){
      uint32_t HcEpType = (HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) & USB_OTG_HCCHAR_EPTYP) >> 18;
      uint32_t len = (HWREG32(u32Base + USB_OTG_HCTSIZ0 + 0x20UL * ch_num) & (0x7FFFFUL << 0));
      if(HcEpType == EP_TYPE_BULK || HcEpType == EP_TYPE_INTR){
        //hc->toggle_out ^= 1U;
        hc->toggle = ((HWREG32(u32Channel + USB_OTG_HCTSIZ0) >> 29) & 0x03UL);
      }
      hc->error_count = 0;
      hc->nak_count = 0;
      if (HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN){
        hc->count = hc->size;
        hc->xfer_done = 1;
      } else {
        hc->count = hc->count + len;
        if(hc->count>= hc->size){
          hc->xfer_done = 1;
        }else{
          hc->state = USB_CS_XFER_ONGOING;
          USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
          usb_otg_channel_halt(u32Base, ch_num);
          //tusb_otg_host_submit(host, ch_num);
        }
      }
    }
    else if (hc->state == USB_CS_NAK)
    {
      hc->nak_count++;
      hc->error_count = 0;
//      if(hc->nak_count > MAX_NAK_RETRY_TIME){
//        hc->xfer_done = 1;
//      }else{
        hc->state = USB_CS_INIT;
        //USB_OTG_UNMASK_HALT_HC_INT(ch_num);
        //usb_otg_channel_halt(u32Base, ch_num);
        usb_otg_host_submit(host, ch_num);
        /*
        if (USBx->GAHBCFG & USB_OTG_GAHBCFG_DMAEN){
          tmpreg = HC->HCCHAR;
          tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
          tmpreg |= USB_OTG_HCCHAR_CHENA;
          HC->HCCHAR = tmpreg;
        }else{
          tusb_otg_host_submit(host, ch_num);
        }
        */
//        tmpreg = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num);
//        tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
//        tmpreg |= USB_OTG_HCCHAR_CHENA;
//        HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) = tmpreg;
//      }
    }
    else if (hc->state == USB_CS_ACK)
    {
      if(hc->do_ping){
        hc->do_ping = 0;
        hc->state = USB_CS_XFER_ONGOING;
        USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
        usb_otg_channel_halt(u32Base, ch_num);
      } else {
        if (HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN){
          if(host->state == USB_HOST_PORT_ENABLED) {
            USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
            tmpreg = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num);
            tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
            tmpreg |= USB_OTG_HCCHAR_CHENA;
            HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) = tmpreg;
          }
        }
      }
    }
    else if (hc->state == USB_CS_NYET)
    {
      // not yet, do ping
      hc->do_ping = 1;
      hc->state = USB_CS_XFER_ONGOING;
      USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
      usb_otg_channel_halt(u32Base, ch_num);
    }
    else if (hc->state == USB_CS_STALL)
    {
      hc->xfer_done = 1;
    }
    else if (hc->state == USB_CS_TRANSACTION_ERROR)
    {
      hc->error_count++;
      if(hc->error_count > MAX_ERROR_RETRY_TIME){
        hc->xfer_done = 1;
      }else{
        /* re-activate the channel  */
          tmpreg = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num);
          tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
          tmpreg |= USB_OTG_HCCHAR_CHENA;
          HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) = tmpreg;
      }
    }
    else if (hc->state == USB_CS_DT_ERROR)
    {
        hc->xfer_done = 1;
    }
    else
    {
      /* ... */
      if (HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN){
        if(host->state == USB_HOST_PORT_ENABLED) {
          usb_otg_host_submit(host, ch_num);
//          USB_OTG_UNMASK_HALT_HC_INT(u32Base, ch_num);
//          tmpreg = HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num);
//          tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
//          tmpreg |= USB_OTG_HCCHAR_CHENA;
//          HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) = tmpreg;
        }
      }
    }

    USB_OTG_CLEAR_HC_INT(u32Base, ch_num, USB_OTG_HCINT_CHH);
    usb_host_notify_urb_finish_callback(host, ch_num);
  }
  else
  {
     /* ... */
  }
}

