ChalesYu/rtl8822bs-aml/RT-Thread/RT-Thread/board/usb/stm32_usb_otg_host.c
/*********************************************************************************************************
** Function name:       usb_otg_host_handler
** Descriptions:        usb host channel中断处理函数
** input parameters:    host:    USB主机特征结构   
**                      ch_num:  指定处理channel号
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
rt_inline uint32_t usb_host_interrupt(uint32_t u32Base)
{
  uint32_t v;
  
  v = HWREG32(u32Base + USB_OTG_GINTSTS);
  v &= HWREG32(u32Base + USB_OTG_GINTMSK);
  
  return v;  
}
#define  USB_HOST_INTR()   usb_host_interrupt(u32Base)
void usb_otg_host_handler(stm32_usb_host_t* host)
{
  uint32_t u32Base = host->base;
  
  if(USB_HOST_INTR() == 0){
    return;
  }
  if(USB_HOST_INTR() & USB_OTG_GINTSTS_PXFR_INCOMPISOOUT ){
    HWREG32(u32Base + USB_OTG_GINTSTS) = USB_OTG_GINTSTS_PXFR_INCOMPISOOUT;
  }
  if(USB_HOST_INTR() & USB_OTG_GINTSTS_IISOIXFR){
    HWREG32(u32Base + USB_OTG_GINTSTS) = USB_OTG_GINTSTS_IISOIXFR;
  }
  if(USB_HOST_INTR() & USB_OTG_GINTSTS_PTXFE){
    uint32_t mask = host->ptx_pending;
    uint8_t ch_num = 0;
    HWREG32(u32Base + USB_OTG_GINTSTS) = USB_OTG_GINTSTS_PTXFE;
    while(mask){
      if(mask & 1){
        usb_otg_data_send(host, ch_num);
        break;
      }
      ch_num++;
      mask>>=1;
    }
    if(!host->ptx_pending){
      HWREG32(u32Base + USB_OTG_GINTMSK) &= ~USB_OTG_GINTMSK_PTXFEM;
    }
    
  }
  if(USB_HOST_INTR() & USB_OTG_GINTSTS_NPTXFE){
    uint32_t mask = host->nptx_pending;
    uint8_t ch_num = 0;
    HWREG32(u32Base + USB_OTG_GINTSTS) = USB_OTG_GINTSTS_NPTXFE;
    while(mask){
      if(mask & 1){
        usb_otg_data_send(host, ch_num);
        break;
      }
      ch_num++;
      mask>>=1;
    }
    if(!host->nptx_pending){
      HWREG32(u32Base + USB_OTG_GINTMSK) &= ~USB_OTG_GINTMSK_NPTXFEM;
    }
  }
  if(USB_HOST_INTR() & USB_OTG_GINTSTS_MMIS){
    HWREG32(u32Base + USB_OTG_GINTSTS) = USB_OTG_GINTSTS_MMIS;
  }
  /* Handle Host Disconnect Interrupts */
  if(USB_HOST_INTR() & USB_OTG_GINTSTS_DISCINT){
    /* Cleanup HPRT */
    HWREG32(u32Base + USB_OTG_HPRT) &= ~((1UL << 2) | (1UL << 1) | (1UL << 3) | (1UL << 5));
    /* Handle Host Port Interrupts */
    usb_otg_host_disconnect(host);
    usb_otg_phy_clock_set(u32Base, HCFG_48_MHZ);
    
    HWREG32(u32Base + USB_OTG_GINTSTS) = USB_OTG_GINTSTS_DISCINT;
  }
  /* Handle Host Port Interrupts */
  if( USB_HOST_INTR() & USB_OTG_GINTSTS_HPRTINT ){
    usb_host_port_handler(host);
  }
  /* Handle Host SOF Interrupts */
  if( USB_HOST_INTR() & USB_OTG_GINTSTS_SOF ){
      HWREG32(u32Base + USB_OTG_GINTSTS) = USB_OTG_GINTSTS_SOF;
      usb_host_sof_callback(host);
  }
  /* Handle Host channel Interrupts */
  if(USB_HOST_INTR() & USB_OTG_GINTSTS_HCINT ){
    uint32_t hc_intr = (HWREG32(u32Base + USB_OTG_HAINT) & 0xFFFFU);
    uint32_t ch_num = 0;
    while(hc_intr){
      if(hc_intr & 1){
        if(HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * ch_num) & USB_OTG_HCCHAR_EPDIR){
          usb_otg_in_channel_handler(host, ch_num);
        }else{
          usb_otg_out_channel_handler(host, ch_num);
        }
        //tusb_otg_host_channel_handler(host, ch_num);
      }
      ch_num++;
      hc_intr>>=1;
      if(ch_num > host->channel_num) break;
    }
    HWREG32(u32Base + USB_OTG_GINTSTS) = USB_OTG_GINTSTS_HCINT;
  }
  /* Handle Rx Queue Level Interrupts */
  if( USB_HOST_INTR() & USB_OTG_GINTSTS_RXFLVL ){
    HWREG32(u32Base + USB_OTG_GINTMSK) &= ~(1UL << USB_OTG_GINTSTS_RXFLVL);
    usb_otg_host_rx_handler(host);
    HWREG32(u32Base + USB_OTG_GINTMSK) |= (1UL << USB_OTG_GINTSTS_RXFLVL);
    
  }
}

/*********************************************************************************************************
** Function name:       usb_host_channel_init
** Descriptions:        usb host初始化一个channel
** input parameters:    host:    USB主机特征结构   
**                      ch_num:  指定处理channel号
**                      dev_addr：设备地址
**                      ep_addr： 设备端点地址
**                      ep_type： 断点类型
**                      mps：     最大包长度
**                      speed：   channel速度
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
void usb_host_channel_init(stm32_usb_host_t* host, uint8_t ch_num, uint8_t dev_addr, 
                           uint8_t ep_addr, uint8_t ep_type, uint16_t mps, uint8_t speed)
{
  uint32_t u32Base = host->base;
  uint32_t u32Channel = u32Base + 0x20UL * ch_num;
  stm32_usb_host_channel_t* hc = &host->hc[ch_num];

  // clear old interrupt flags
  HWREG32(u32Channel + USB_OTG_HCINT0) = 0xFFFFFFFFU;
  switch(ep_type){
    case EP_TYPE_CTRL:
    case EP_TYPE_BULK:
      HWREG32(u32Channel + USB_OTG_HCINTMSK0) = USB_OTG_HCINTMSK_XFRCM  |
                     USB_OTG_HCINTMSK_STALLM |
                     USB_OTG_HCINTMSK_TXERRM |
                     USB_OTG_HCINTMSK_DTERRM |
                     USB_OTG_HCINTMSK_AHBERR |
                     USB_OTG_HCINTMSK_NAKM;
      if (ep_addr & 0x80){
        HWREG32(u32Channel + USB_OTG_HCINTMSK0) |= USB_OTG_HCINTMSK_BBERRM;
      }else{
       // if(u32Base != USB2_OTG_FS_BASE){
        if(host->phy_speed == USB_OTG_SPEED_HIGH){
          HWREG32(u32Channel + USB_OTG_HCINTMSK0) |= (USB_OTG_HCINTMSK_NYET | USB_OTG_HCINTMSK_ACKM);
        }
      }
      break;
    case EP_TYPE_INTR:
      HWREG32(u32Channel + USB_OTG_HCINTMSK0) = USB_OTG_HCINTMSK_XFRCM  |
                     USB_OTG_HCINTMSK_STALLM |
                     USB_OTG_HCINTMSK_TXERRM |
                     USB_OTG_HCINTMSK_DTERRM |
                     USB_OTG_HCINTMSK_NAKM   |
                     USB_OTG_HCINTMSK_AHBERR |
                     USB_OTG_HCINTMSK_FRMORM;

    if (ep_addr & 0x80){
      HWREG32(u32Channel + USB_OTG_HCINTMSK0) |= USB_OTG_HCINTMSK_BBERRM;
    }
    break;
    case EP_TYPE_ISOC:
      HWREG32(u32Channel + USB_OTG_HCINTMSK0) = USB_OTG_HCINTMSK_XFRCM  |
                     USB_OTG_HCINTMSK_ACKM   |
                     USB_OTG_HCINTMSK_AHBERR |
                     USB_OTG_HCINTMSK_FRMORM;
    if ( ep_addr & 0x80U ){
      HWREG32(u32Channel + USB_OTG_HCINTMSK0) |= (USB_OTG_HCINTMSK_TXERRM | USB_OTG_HCINTMSK_BBERRM);
    }
    break;
  }
  
  HWREG32(u32Base + USB_OTG_HAINTMSK) |= 1UL << (ch_num & 0xFU);
  /* Make sure host channel interrupts are enabled. */
  HWREG32(u32Base + USB_OTG_GINTMSK) |= USB_OTG_GINTMSK_HCIM;
  HWREG32(u32Channel + USB_OTG_HCTSIZ0) = 0;
  HWREG32(u32Channel + USB_OTG_HCCHAR0) = ( ((uint32_t)dev_addr << 22 ) |
                                           ((uint32_t)(ep_addr&0x7f) << 11 ) | 
                                           ((uint32_t)ep_type  << 18 ) |
                                          ((uint32_t)mps & (0x7FFUL << 0)));
  
                    
  if(ep_addr & 0x80){
    HWREG32(u32Channel + USB_OTG_HCCHAR0) |= USB_OTG_HCCHAR_EPDIR;
  }
  if( speed == USB_OTG_SPEED_LOW){
    HWREG32(u32Channel + USB_OTG_HCCHAR0) |= (1UL << 17);
  }
  
  if (ep_type == EP_TYPE_INTR){
    HWREG32(u32Channel + USB_OTG_HCCHAR0) |= (1UL << 29) ;
  }
  
