ChalesYu/rtl8822bs-aml/RT-Thread/RT-Thread/board/usb/stm32_usb_otg_host.c
  memset(hc, 0, sizeof(*hc));
  hc->speed = speed;
  hc->is_use = 1;
}

/*********************************************************************************************************
** Function name:       usb_port_get_speed
** Descriptions:        usb host速度读取
** input parameters:    host:    USB主机特征结构   
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
uint8_t usb_port_get_speed(stm32_usb_host_t* host)
{
  uint32_t u32Base = host->base;
  uint32_t u32Temp;
  
  u32Temp = (HWREG32(u32Base + USB_OTG_HPRT) >> 17) & 0x03U;
  switch(u32Temp)
  {
  case 0:
    return USB_OTG_SPEED_HIGH;
  case 1:
    return USB_OTG_SPEED_FULL;
  case 2:
    return USB_OTG_SPEED_LOW;
  default:
    return USB_OTG_SPEED_FULL;
  }
}

/*********************************************************************************************************
** Function name:       usb_host_channel_deinit
** Descriptions:        usb host channel反初始化
** input parameters:    host:    USB主机特征结构   
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
void usb_host_channel_deinit(stm32_usb_host_t* host, uint8_t ch_num)
{
  uint32_t u32Base = host->base;
  uint32_t u32Channel = u32Base + 0x20UL * ch_num;
  stm32_usb_host_channel_t* hc = &host->hc[ch_num];
  
  // close all interrupt mask
  HWREG32(u32Channel + USB_OTG_HCINTMSK0) = 0;
  HWREG32(u32Channel + USB_OTG_HCCHAR0) = 0;
  memset(hc, 0, sizeof(*hc));
}

/*********************************************************************************************************
** Function name:       usb_otg_host_get_free_ch
** Descriptions:        usb host获取一个空闲的channel
** input parameters:    host:    USB主机特征结构   
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
uint8_t  usb_otg_host_get_free_ch(stm32_usb_host_t* host)
{
  uint32_t u32Base = host->base;
  uint32_t i;
  for(i=0;i<host->channel_num;i++){
    if(!host->hc[i].is_use){
      if( (HWREG32(u32Base + USB_OTG_HCCHAR0 + 0x20UL * i) & USB_OTG_HCCHAR_CHENA) == 0 ) {
        return i;
      }
    }
  }
  return 0xff;
}

/*********************************************************************************************************
** Function name:       usb_otg_data_send
** Descriptions:        usb host发送数据
** input parameters:    host:    USB主机特征结构   
**                      ch_num:  发送数据的channel
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
static void usb_otg_data_send(stm32_usb_host_t* host, uint8_t ch_num)
{
  uint32_t u32Base = host->base;
  uint32_t u32Channel = u32Base + 0x20UL * ch_num;
  uint32_t mps = HWREG32(u32Channel + USB_OTG_HCCHAR0) & (0x7FFUL);
  uint8_t xfer_type = (HWREG32(u32Channel + USB_OTG_HCCHAR0) >> 18) & 0x03UL;
  stm32_usb_host_channel_t* hc = &host->hc[ch_num];
  uint32_t i;
  uint32_t act_len;
  uint32_t req_size;
  uint32_t *pSrc = (uint32_t *)(hc->ch_buf + hc->count);
  uint32_t len = (HWREG32(u32Base + USB_OTG_HCTSIZ0 + 0x20UL * ch_num) & 0x7FFFFUL);
  // len = (len+3)/4;
  if(xfer_type == EP_TYPE_CTRL || xfer_type == EP_TYPE_BULK){
    act_len = HWREG32(u32Base + USB_OTG_GNPTXSTS);
  }else{
    act_len = HWREG32(u32Base + USB_OTG_HPTXSTS);
  }
  // calculate useful FIFO size, depend on two factor
  // 1. remain [request queue space] * [max packet size]
  req_size = ((act_len & 0xff0000) >> 16) * mps;
  // 2. remain FIFO buffer size, round to max packet size boundary
  act_len = ( (act_len & 0xffff) *4 / mps )  * mps;
  if(act_len > req_size) act_len = req_size;
  if(len > act_len){
    len = len - act_len;
  }else{
    act_len = len;
    len = 0;
  }
  act_len = (act_len+3)/4;
  for(i=0;i<act_len;i++){
    HWREG32(u32Base + USB_OTG_FIFO_BASE + (ch_num * USB_OTG_FIFO_SIZE)) = *((__packed rt_uint32_t *)pSrc);
    pSrc++;
  }
  if(len){
    if(xfer_type == EP_TYPE_CTRL || xfer_type == EP_TYPE_BULK){
      HWREG32(u32Base + USB_OTG_GINTMSK) |= USB_OTG_GINTMSK_NPTXFEM;
      host->nptx_pending |= (1<<ch_num);
    }else{
      HWREG32(u32Base + USB_OTG_GINTMSK) |= USB_OTG_GINTMSK_PTXFEM;
      host->ptx_pending |= (1<<ch_num);
    }
  }else{
    host->nptx_pending &= ~(1<<ch_num);
    host->ptx_pending &= ~(1<<ch_num);
  }
}

/*********************************************************************************************************
** Function name:       usb_otg_host_submit
** Descriptions:        usb host发送一次urb事物
** input parameters:    host:    USB主机特征结构   
**                      ch_num:  发送数据的channel
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
uint32_t usb_otg_host_submit(stm32_usb_host_t* host, uint8_t ch_num)
{
  uint32_t u32Base = host->base;
  uint32_t u32Channel = u32Base + 0x20UL * ch_num;
  stm32_usb_host_channel_t* hc = &host->hc[ch_num];
  uint32_t mps = HWREG32(u32Channel + USB_OTG_HCCHAR0) & (0x7FFUL);
  uint8_t xfer_type = (HWREG32(u32Channel + USB_OTG_HCCHAR0) >> 18) & 0x03UL;
  uint32_t pkt_cnt;
  uint32_t len = hc->size - hc->count;
  uint32_t data_pid = HC_PID_DATA1;
  uint8_t is_in = (HWREG32(u32Channel + USB_OTG_HCCHAR0) & USB_OTG_HCCHAR_EPDIR) != 0;
  uint8_t is_dma = (HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN) != 0;
  uint8_t is_data = hc->is_data;
  
  pkt_cnt = (len + mps - 1) / mps;
  if(!pkt_cnt) pkt_cnt = 1;
  if(is_in){
    len = pkt_cnt * mps;
  }else{
    if(!is_dma){
      if(len>mps){
        len = mps;
        pkt_cnt = 1;
      }
    }
  }
  len = (len & (0x7FFFFUL << 0));
  
  switch( xfer_type ){
    case EP_TYPE_CTRL:
      if(is_data){
        if(len == 0){
          if(is_in){
            // control in
          }else{
            // control out
            hc->toggle = 1;
            data_pid = HC_PID_DATA1;
          }
        }
      }else{
        // otherwise setup packet
        data_pid = HC_PID_SETUP;
      }
      break;
    case EP_TYPE_BULK:
    case EP_TYPE_INTR:
      data_pid = ((HWREG32(u32Channel + USB_OTG_HCTSIZ0) >> 29) & 0x03UL);
#if 0
      if(is_in){
        data_pid = hc->toggle_in ? HC_PID_DATA1 : HC_PID_DATA0;
      }else{
        data_pid = hc->toggle_out ? HC_PID_DATA1 : HC_PID_DATA0;
      }
#endif
      break;
    case EP_TYPE_ISOC:
      data_pid = HC_PID_DATA0;
      break;
  }
  
  if(hc->do_ping){
    HWREG32(u32Channel + USB_OTG_HCTSIZ0) = ((1 << 19) | (1UL << 31)) ;
  } else{
    HWREG32(u32Channel + USB_OTG_HCTSIZ0) = ((len << 0) | (pkt_cnt << 19) | (data_pid  << 29));
    
