ChalesYu/rtl8822bs-aml/RT-Thread/RT-Thread/board/usb/stm32_usb_otg_host.c
    if (HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN){
      HWREG32(u32Channel + USB_OTG_HCINTMSK0) |= USB_OTG_HCINTMSK_CHHM;
      /* xfer_buff MUST be 32-bits aligned */
      rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, (void *)hc->ch_buf, len);
      HWREG32(u32Channel + USB_OTG_HCDMA0) = (uint32_t)hc->ch_buf;
      if(((uint32_t)hc->ch_buf) & 0x03) {
        rt_kprintf("usb aligned error\r\n");
      }
    }
    
    if(HWREG32(u32Base + USB_OTG_HFNUM) & 0x01U){
      HWREG32(u32Channel + USB_OTG_HCCHAR0) &= ~USB_OTG_HCCHAR_ODDFRM;
    }else{
      HWREG32(u32Channel + USB_OTG_HCCHAR0) |= USB_OTG_HCCHAR_ODDFRM;
    }
  }
  {
    uint32_t tmpreg = HWREG32(u32Channel + USB_OTG_HCCHAR0);
    tmpreg &= ~USB_OTG_HCCHAR_CHDIS;
    tmpreg |= USB_OTG_HCCHAR_CHENA;
    HWREG32(u32Channel + USB_OTG_HCCHAR0) = tmpreg;
  }
  
  if( (!is_dma) && (!is_in) && len && (!hc->do_ping) ){
    usb_otg_data_send(host, ch_num);
  }
  
  return 0;
}

/*********************************************************************************************************
** Function name:       usb_otg_host_xfer_data
** Descriptions:        usb host传输一次数据
** input parameters:    host:    USB主机特征结构   
**                      ch_num:  发送数据的channel
**                      is_data：1：传输数据；0：传输setup
**                      data:    传输数据存放地址
**                      len：    数据缓冲区大小
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
uint32_t usb_otg_host_xfer_data(stm32_usb_host_t* host, uint8_t ch_num, uint8_t is_data, uint8_t* data, uint32_t len)
{
  uint32_t u32Base = host->base;
  uint32_t u32Channel = u32Base + 0x20UL * ch_num;
  stm32_usb_host_channel_t* hc = &host->hc[ch_num];
//  uint32_t mps = HWREG32(u32Channel + USB_OTG_HCCHAR0) & (0x7FFUL);
//  uint8_t is_in = (HWREG32(u32Channel + USB_OTG_HCCHAR0) & USB_OTG_HCCHAR_EPDIR) != 0;
//  (void)is_in;
//  (void)mps;
  uint8_t is_dma = (HWREG32(u32Base + USB_OTG_GAHBCFG) & USB_OTG_GAHBCFG_DMAEN) != 0;

  hc->ch_buf = data;
  hc->size = len;
  hc->count = 0;
  hc->state = USB_CS_INIT;
  hc->do_ping = 0;
  hc->is_data = is_data;
  hc->xfer_done = 0;
  hc->error_count = 0;
  hc->nak_count = 0;
  
  if(((HWREG32(u32Channel + USB_OTG_HCCHAR0) >> 18) & 0x03UL) == EP_TYPE_BULK){
    if(is_dma){
      // DMA enabled, not ping
      HWREG32(u32Channel + USB_OTG_HCINTMSK0) &= ~(USB_OTG_HCINTMSK_NYET | USB_OTG_HCINTMSK_ACKM);
    }else if (hc->speed == USB_OTG_SPEED_HIGH ) {
      // PORT speed is HIGH
      hc->do_ping = 1;
    }
  }
  rt_completion_init(&hc->urb_completion);
  usb_otg_host_submit(host, ch_num);
  return 0;
}

/*********************************************************************************************************
** Function name:       usb_host_xfer_wait
** Descriptions:        usb host传输等待
** input parameters:    host:    USB主机特征结构   
**                      ch_num:  发送数据的channel
**                      timeout：超时时间，以tick为单位
** output parameters:   NONE
** Returned value:      NONE
*********************************************************************************************************/
int usb_host_xfer_wait(stm32_usb_host_t* host, uint8_t ch_num, int32_t timeout)
{
  if(rt_completion_wait(&host->hc[ch_num].urb_completion, timeout) != RT_EOK) {
    usb_otg_channel_halt(host->base, ch_num);
    return -1;
  }
  
  return 0;
}
/*********************************************************************************************************
END FILE
*********************************************************************************************************/
